/* PhotoType.java
 * nadeuli Service - 여행
 * 어떤 사진인지 구분할 PhotoType (확장자 x, 프로필 사진 o)
 * 작성자 : 이홍비
 * 최종 수정 날짜 : 2025.02.28
 *
 * ========================================================
 * 프로그램 수정 / 보완 이력
 * ========================================================
 * 작업자        날짜        수정 / 보완 내용
 * ========================================================
 * 이홍비    2025.02.25     최초 작성 : PhotoType
 * ========================================================
 */

package nadeuli.common;

public enum PhotoType {
    ETC, // 그 외
    JOURNAL, // 여행 사진
    PROFILE // 프로필 사진
}
